#### DataFrame

In [1]:
import pandas as pd

In [9]:
record1 = pd.Series({"Name": "Alice",
                     "Class": "Physics",
                     "Score":85})
record2 = pd.Series({"Name": "Jack",
                     "Class": "Chemistry",
                     "Score":82})
record3 = pd.Series({"Name": "Helan",
                     "Class": "Biology",
                     "Score":90})

In [6]:
df =pd.DataFrame([record1,record2,record3],
                  index=["school1","school2","school3"])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helan    Biology     90

In [21]:
students =[{"Name": "Alice",
                     "Class": "Physics",
                     "Score":85},
           {"Name": "Jack",
                     "Class": "Chemistry",
                     "Score":82},
           {"Name": "Helan",
                     "Class": "Biology",
                     "Score":90}
]
df =pd.DataFrame(students,index=["school1","school2","school1"])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helan    Biology     90

In [22]:
df.loc["school2"]

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [23]:
type(df.loc["school2"])

pandas.core.series.Series

In [26]:
df.loc["school1"]

          Name    Class  Score
school1  Alice  Physics     85
school1  Helan  Biology     90

In [25]:
type(df.loc["school1"])

pandas.core.frame.DataFrame

In [32]:
df.loc["school1",["Name","Class"]]

          Name    Class
school1  Alice  Physics
school1  Helan  Biology

In [33]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helan
Class  Physics  Chemistry  Biology
Score       85         82       90

In [34]:
df.T.loc["Name"]

school1    Alice
school2     Jack
school1    Helan
Name: Name, dtype: object

In [35]:
df["Name"]

school1    Alice
school2     Jack
school1    Helan
Name: Name, dtype: object

In [36]:
type(df["Name"])

pandas.core.series.Series

In [37]:
df.loc["school1"]["Name"]

school1    Alice
school1    Helan
Name: Name, dtype: object

In [43]:
print(type(df.loc["school1"]))
print(type(df.loc["school1"]["Name"]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [48]:
df.loc[:,["Name","Score"]]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helan     90

In [51]:
df.drop("school1")

         Name      Class  Score
school2  Jack  Chemistry     82

In [52]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helan    Biology     90

In [55]:
copy_df = df.copy()
copy_df.drop("Name",inplace=True,axis=1)

In [56]:
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [57]:
del copy_df["Class"]
copy_df

         Score
school1     85
school2     82
school1     90

In [60]:
df["ClassRanking"] =None
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helan    Biology     90         None